# <font color='green'> <b>Text Data - String Methods</b><font color='black'>

**str.lower():** Bir stringi küçük harfe dönüştürür

**str.upper():** Bir stringi büyük harfe dönüştürür

**str.capitalize():** İlk karakteri büyük harfe dönüştürür

**str.title():** Her kelimenin ilk karakterini büyük harfe dönüştürür

**str.swapcase():** Büyük harfleri küçük, küçük harfleri büyük harfe dönüştürür

**str.isalpha():** Tüm karakterlerin alfabede yer alıp almadığını kontrol ederek True veya False değeri döndürür

**str.isnumeric():** Tüm karakterlerin sayısal değer içerip içermediğini kontrol ederek True veya False değeri döndürür

**str.isalnum():** Tüm karakterlerin harf veya sayısal değer içerip içermediğini kontrol ederek True veya False değeri döndürür

**str.endswith():** Bir stringin belirtilen değerle bittiğini kontrol ederek True veya False değeri döndürür

**str.startswith():** Bir stringin belirtilen değerle başladığını kontrol ederek True veya False değeri döndürür

**str.contains():** Bir alt dizinin bir dizede bulunup bulunmadığını kontrol ederek her bir öğe için True veya False değeri döndürür

**str.strip():** Bir stringin başındaki ve sonundaki boşlukları temizler ve kırpılmış bir versiyonunu döndürür

**str.replace():** Belirtilen bir değeri başka bir değerle değiştirilmiş bir string döndürür 

**str.split():** Bir stringi belirtilen ayraçta böler ve bir liste döndürür

**str.find():** Bir stringde belirtilen bir değeri arar ve bulunduğu konumun indeksini döndürür

**str.findall():** Bir desendeki tüm örneklerin bir listesini döndürür

**str.join():** Bir iterable ın öğelerini bir stringe dönüştürür

[SOURCE01](https://docs.python.org/3/library/stdtypes.html#string-methods),
[SOURCE02](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html),
[SOURCE03](https://www.aboutdatablog.com/post/10-most-useful-string-functions-in-pandas),
[SOURCE04](https://www.tutorialspoint.com/python_pandas/python_pandas_working_with_text_data.htm) &
[Video](https://www.youtube.com/watch?v=6JNwK6hEneg)

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(data=[['Tyler DURDEN', 'HR', "manager", "$180,000", 55],
                        ['MARIA puder', "IT", "data analyst", "150000dolar", 28],
                        ['dorothy gale', "HR", "recruiter", "$120,000", 30],
                        ['Edmond Dantes', "IT", "data scientist", "$170,000","-"], 
                        ['Gregor SAMSA',"IT", "frontend developer", "120000dolar",32]],
                  columns=["name","dept", "job", "salary", "age"])

In [3]:
df

            name dept                 job       salary age
0   Tyler DURDEN   HR             manager     $180,000  55
1    MARIA puder   IT        data analyst  150000dolar  28
2   dorothy gale   HR           recruiter     $120,000  30
3  Edmond Dantes   IT      data scientist     $170,000   -
4   Gregor SAMSA   IT  frontend developer  120000dolar  32

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   dept    5 non-null      object
 2   job     5 non-null      object
 3   salary  5 non-null      object
 4   age     5 non-null      object
dtypes: object(5)
memory usage: 332.0+ bytes

In [5]:
df.name

0     Tyler DURDEN
1      MARIA puder
2     dorothy gale
3    Edmond Dantes
4     Gregor SAMSA
Name: name, dtype: object

In [6]:
df.name.str.lower()

0     tyler durden
1      maria puder
2     dorothy gale
3    edmond dantes
4     gregor samsa
Name: name, dtype: object

In [7]:
df.name.str.upper()

0     TYLER DURDEN
1      MARIA PUDER
2     DOROTHY GALE
3    EDMOND DANTES
4     GREGOR SAMSA
Name: name, dtype: object

In [8]:
df.name.str.title()  # title -->her kelimenin ilk harfini buyuk yapar.

0     Tyler Durden
1      Maria Puder
2     Dorothy Gale
3    Edmond Dantes
4     Gregor Samsa
Name: name, dtype: object

In [9]:
df.name.str.capitalize() # capitalize ilk kelimenin ilk harfi buytuk digerlerini kucuk yapar.

0     Tyler durden
1      Maria puder
2     Dorothy gale
3    Edmond dantes
4     Gregor samsa
Name: name, dtype: object

In [10]:
df.name.str.swapcase() # swapcase--> buyuk harfleri kucuk kucuk harfleri buyuk yapor.

0     tYLER durden
1      maria PUDER
2     DOROTHY GALE
3    eDMOND dANTES
4     gREGOR samsa
Name: name, dtype: object

In [11]:
df.job.str.isalpha() # isalfa-->butun degerleri kontrol edip alfabade olup olmadiklarini kontrol ederek True veya False dondurur.

0     True
1    False
2     True
3    False
4    False
Name: job, dtype: bool

In [12]:
df.salary.str.isalnum()

0    False
1     True
2    False
3    False
4     True
Name: salary, dtype: bool

In [13]:
df.age.str.isnumeric() # numerik olan degerleri True , numerik olmayan degerleri false dondurur.
                       #  - isareti object kategorsinde oldugundan string kabul etmiyor.

0      NaN
1      NaN
2      NaN
3    False
4      NaN
Name: age, dtype: object

In [14]:
df.age.astype("string").str.isnumeric()

0     True
1     True
2     True
3    False
4     True
Name: age, dtype: boolean

In [15]:
df.age.str.islower()

0      NaN
1      NaN
2      NaN
3    False
4      NaN
Name: age, dtype: object

In [16]:
df.age.astype("string").str.islower()

0    False
1    False
2    False
3    False
4    False
Name: age, dtype: boolean

In [17]:
df.name.str.isupper()

0    False
1    False
2    False
3    False
4    False
Name: name, dtype: bool

In [18]:
df

            name dept                 job       salary age
0   Tyler DURDEN   HR             manager     $180,000  55
1    MARIA puder   IT        data analyst  150000dolar  28
2   dorothy gale   HR           recruiter     $120,000  30
3  Edmond Dantes   IT      data scientist     $170,000   -
4   Gregor SAMSA   IT  frontend developer  120000dolar  32

In [19]:
df.job.str.startswith("f")

0    False
1    False
2    False
3    False
4     True
Name: job, dtype: bool

In [20]:
df.job.str.endswith("st")

0    False
1     True
2    False
3     True
4    False
Name: job, dtype: bool

In [21]:
df.job.str.contains("data")

0    False
1     True
2    False
3     True
4    False
Name: job, dtype: bool

In [22]:
df[df.job.str.contains("data")]  # contains--> iceriyor mu

            name dept             job       salary age
1    MARIA puder   IT    data analyst  150000dolar  28
3  Edmond Dantes   IT  data scientist     $170,000   -

In [23]:
df.salary

0       $180,000
1    150000dolar
2       $120,000
3       $170,000
4    120000dolar
Name: salary, dtype: object

In [24]:
df.salary.str.rstrip("dolar")

0    $180,000
1      150000
2    $120,000
3    $170,000
4      120000
Name: salary, dtype: object

In [25]:
df.salary.str.rsplit("dolar")

0    [$180,000]
1    [150000, ]
2    [$120,000]
3    [$170,000]
4    [120000, ]
Name: salary, dtype: object

In [26]:
df.salary.str.rstrip("dolar").str.lstrip("$")

0    180,000
1     150000
2    120,000
3    170,000
4     120000
Name: salary, dtype: object

In [27]:
df.salary.str.strip("dolar$") # sayilar yanindaki $ isaretini temizleyelim

0    180,000
1     150000
2    120,000
3    170,000
4     120000
Name: salary, dtype: object

In [28]:
df.salary.str.strip("dolar$,")   # strip() baştan ve sondan değişiklik yapar

0    180,000
1     150000
2    120,000
3    170,000
4     120000
Name: salary, dtype: object

In [29]:
df.salary.str.strip("dolar$").str.replace(",", "")

0    180000
1    150000
2    120000
3    170000
4    120000
Name: salary, dtype: object

In [30]:
df.salary.str.strip("dolar$").replace(",", "")

0    180,000
1     150000
2    120,000
3    170,000
4     120000
Name: salary, dtype: object

In [31]:
df.salary.str.strip("dolar$").str.replace(",", "").astype(float)

0    180000.0
1    150000.0
2    120000.0
3    170000.0
4    120000.0
Name: salary, dtype: float64

In [32]:
df.salary = df.salary.str.strip("dolar$").str.replace(",", "").astype(float)

In [37]:
df.salary

0    180000.0
1    150000.0
2    120000.0
3    170000.0
4    120000.0
Name: salary, dtype: float64

In [33]:
# df.str.replace("a", "")   # str ile sütunlar üzerinde işlem yapabiliriz hata verir

In [34]:
df.age.replace("-", np.nan)

0    55.0
1    28.0
2    30.0
3     NaN
4    32.0
Name: age, dtype: float64

In [35]:
df.age= df.age.replace("-", np.nan)
df.age

0    55.0
1    28.0
2    30.0
3     NaN
4    32.0
Name: age, dtype: float64

In [36]:
df

            name dept                 job    salary   age
0   Tyler DURDEN   HR             manager  180000.0  55.0
1    MARIA puder   IT        data analyst  150000.0  28.0
2   dorothy gale   HR           recruiter  120000.0  30.0
3  Edmond Dantes   IT      data scientist  170000.0   NaN
4   Gregor SAMSA   IT  frontend developer  120000.0  32.0